In [267]:
import pandas as pd
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})
df

   A  B
0  1  4
1  2  5
2  3  6

In [273]:
# apply only on B column by using add method
def additionOnRow(x, lab):
    if x['B'] == 5:
        x['B']= x['B']+200
    return x 
    
df.apply(additionOnRow,lab='B', axis = 1)
df

   A    B
0  1    4
1  2  205
2  3    6

In [275]:
#Applies on full dataframe data
df.apply(lambda x: x**2)

   A      B
0  1     16
1  4  42025
2  9     36

In [277]:
# apply only on A column by using lambda
df['A']=df['A'].apply(lambda x: x**2)
df

   A    B
0  1    4
1  4  205
2  9    6

In [279]:
#created method
def add(x,value):
    print("Value passed: ", x)
    return x+value

In [281]:
# apply only on B column by using add method
df['B']=df['B'].apply(add,value=20)
df

Value passed:  4
Value passed:  205
Value passed:  6

   A    B
0  1   24
1  4  225
2  9   26